# GetAllBuiltInGroups Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterUtils..::..GetAllBuiltInGroups Method
ParameterUtils Class See Also
---
Gets the identifiers of all built-in parameter groups.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static IList<ForgeTypeId> GetAllBuiltInGroups()
```

Visual Basic
---
```text
Public Shared Function GetAllBuiltInGroups As IList(Of ForgeTypeId)
```

Visual C++
---
```text
public:
static IList<ForgeTypeId^>^ GetAllBuiltInGroups()
```

# ### Return Value
The built-in group identifiers.
# See Also
ParameterUtils Class
Autodesk.Revit.DB Namespace